# Pandas basics

In [3]:
import numpy as np
import pandas as pd
pd.__version__

'1.5.3'

## Pandas Series

In [4]:
data = pd.Series([0.25,0.5,0.75,1.0])

In [5]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [7]:
data[0]

0.25

In [9]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [10]:
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])

In [11]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
data['c']

0.75

In [13]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [14]:
population_dict = {'California':38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [15]:
population['New York']

19651127

## Pandas dataframe

In [16]:
area_dict = {'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995}
area = pd.Series(area_dict)
states = pd.DataFrame({'population':population,
                       'area':area})

In [17]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [18]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [19]:
states.columns

Index(['population', 'area'], dtype='object')

### Initialization with numpy

In [21]:
df = pd.DataFrame(np.random.rand(4,2),columns=['A','B'])

In [22]:
df

          A         B
0  0.672923  0.207473
1  0.028118  0.741683
2  0.591353  0.954930
3  0.616845  0.755217

In [23]:
df['A']

0    0.672923
1    0.028118
2    0.591353
3    0.616845
Name: A, dtype: float64

In [25]:
df.A

0    0.672923
1    0.028118
2    0.591353
3    0.616845
Name: A, dtype: float64

In [26]:
df = pd.DataFrame(np.random.rand(4,2),columns=['A','B'],index=['a','b','c','d'])

In [27]:
df

          A         B
a  0.510837  0.676265
b  0.136537  0.311834
c  0.279350  0.280527
d  0.373377  0.496632

### Initialization with dictionary

In [30]:
data = {'ColA':[1,2,3,4],
        'ColB':[5,6,7,8],
        'ColC':['A','B','C','D']}
data

{'ColA': [1, 2, 3, 4], 'ColB': [5, 6, 7, 8], 'ColC': ['A', 'B', 'C', 'D']}

In [31]:
df = pd.DataFrame(data)
df

   ColA  ColB ColC
0     1     5    A
1     2     6    B
2     3     7    C
3     4     8    D

### Exercício

Exercise 1: Creating a Pandas DataFrame

Create a Pandas DataFrame from scratch with the following data:

|Country|	Population|	GDP per capita|
|:---------|:---------|:------------|
|USA	|328,200,000|	62,606|
|China	|1,397,710,000|	10,262|
|Japan	|126,150,000|	40,162|

In [32]:
data = {'Country':['USA','China','Japan'],
        'Population':[328200000,1397710000,126150000],
        'GDP per capita':[62606,10262,40162]}
df = pd.DataFrame(data)
df

  Country  Population  GDP per capita
0     USA   328200000           62606
1   China  1397710000           10262
2   Japan   126150000           40162

In [34]:
df['GDP'] = df['Population']*df['GDP per capita']

In [35]:
df

  Country  Population  GDP per capita             GDP
0     USA   328200000           62606  20547289200000
1   China  1397710000           10262  14343300020000
2   Japan   126150000           40162   5066436300000

In [36]:
df['X'] = [10,20,30]

In [37]:
df

  Country  Population  GDP per capita             GDP   X
0     USA   328200000           62606  20547289200000  10
1   China  1397710000           10262  14343300020000  20
2   Japan   126150000           40162   5066436300000  30

### Data indexing and Selection

In [38]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [39]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [40]:
states['density'] = states['population']/states['area']

In [41]:
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [42]:
states.T

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [44]:
states.T['California']

population    3.833252e+07
area          4.239670e+05
density       9.041393e+01
Name: California, dtype: float64

In [45]:
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [48]:
states.iloc[1:3,:2]

          population    area
Texas       26448193  695662
New York    19651127  141297

In [50]:
states.loc['Texas':'Florida',:'area']

          population    area
Texas       26448193  695662
New York    19651127  141297
Florida     19552860  170312

In [52]:
states.loc[states['density'] > 100, ['population','density']]

          population     density
New York    19651127  139.076746
Florida     19552860  114.806121

In [53]:
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [54]:
states.iloc[0,2] = 90

In [55]:
states

            population    area     density
California    38332521  423967   90.000000
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

## Exercício

1. Create a Pandas dataframe with the following data:

|Name|	Age|Gender|
|:--------|:---------|:-------|
|John|	25|	Male|
|Sarah|	30|	Female|
|Michael|	40|	Male|
|Elizabeth|	35|	Female|

2. Use indexing to print the age of Sarah.
3. Use indexing to print the gender of Michael.
4. Use indexing to change the age of Elizabeth to 36.
5. Use indexing to print the name and age of the first three people in the dataframe.
6. Use indexing to select only people with age below 40.

In [57]:
data = {'Name':['John','Sarah','Michael','Elizabeth'],
        'Age':[25,30,40,35],
        'Gender':['Male','Female','Male','Female']}

df = pd.DataFrame(data)
df

        Name  Age  Gender
0       John   25    Male
1      Sarah   30  Female
2    Michael   40    Male
3  Elizabeth   35  Female

In [58]:
print(df.loc[df['Name']=='Sarah','Age'])

1    30
Name: Age, dtype: int64

In [59]:
print(df.loc[df['Name']=='Michael','Gender'])

2    Male
Name: Gender, dtype: object

In [60]:
df.loc[df['Name']=='Elizabeth','Age'] = 36
print(df)

        Name  Age  Gender
0       John   25    Male
1      Sarah   30  Female
2    Michael   40    Male
3  Elizabeth   36  Female

In [61]:
df.loc[0:2,['Name','Age']]

      Name  Age
0     John   25
1    Sarah   30
2  Michael   40

In [62]:
df.loc[df['Age']<40]

        Name  Age  Gender
0       John   25    Male
1      Sarah   30  Female
3  Elizabeth   36  Female

Problem 2:

Suppose you have a DataFrame, df, containing information about different countries, including their names, populations, and GDPs. Write a Python code to perform the following tasks:

- Create a new column called 'GDP per capita' that represents the GDP per capita for each country.
- Find the country with the highest GDP per capita.
- Find the average population for countries with a GDP greater than 40000.
- Create a new DataFrame called top_countries that contains the names and populations of the top 3 countries with the highest GDP per capita.

In [82]:
df = pd.DataFrame({
    'country': ['USA', 'China', 'Japan', 'Germany', 'India'],
    'population': [328200000, 1393000000, 126500000, 83020000, 1353000000],
    'GDP': [21300000, 14200000, 5085000, 4040000, 2999000]
})

In [83]:
df['GDP'] = df['GDP']*1e6

In [84]:
df['GDP per capita'] = df['GDP'] / df['population']
df

   country  population           GDP  GDP per capita
0      USA   328200000  2.130000e+13    64899.451554
1    China  1393000000  1.420000e+13    10193.826274
2    Japan   126500000  5.085000e+12    40197.628458
3  Germany    83020000  4.040000e+12    48662.972778
4    India  1353000000  2.999000e+12     2216.555802

In [69]:
max_country = df.loc[df['GDP per capita'].idxmax(), 'country']
print(f'idxmax: {df["GDP per capita"].idxmax()}')
max_country

idxmax: 0

'USA'

In [87]:
df.loc[df['GDP per capita'] > 40000,'population'].mean()

179240000.0

In [92]:
top_countries = df.sort_values(by='GDP per capita',ascending=False).head(3)
top_countries = top_countries[['country','population']]
top_countries

   country  population
0      USA   328200000
3  Germany    83020000
2    Japan   126500000